Backrooms/src/Documents/ЗаявкаНаМероприятие/ЗаявкаНаМероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаМероприятие</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйОрганизатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеМероприятия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКЗаявке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
</mdclass:Document>

Backrooms/src/Enums/ТипыАккаунтов/ТипыАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАккаунтов</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>Участник</name>
  </enumValues>
  <enumValues>
    <name>Учащийся</name>
  </enumValues>
</mdclass:Enum>

Backrooms/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
</mdclass:Enum>

Backrooms/src/Catalogs/Мероприятия/Мероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мероприятия</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйОрганизатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщедоступнаяРегистрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКартинки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокУчастников</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Распределение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распределения</name>
    <attributes>
      <name>Распределение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аудитория</name>
      <type>
        <types>CatalogRef.Аудитории</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Backrooms/src/Documents/ЗаявкаНаМероприятие/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Организатор Тогда
		Если Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Согласовано Или Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Отклонено Тогда
			Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Черновик;
		КонецЕсли;
	Иначе
		Если Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Согласовано Тогда
			Мероприятие = Справочники.Мероприятия.ПустаяСсылка().ПолучитьОбъект();
			Мероприятие.Наименование = Объект.НазваниеМероприятия;
			Мероприятие.ГлавныйОрганизатор = Объект.ГлавныйОрганизатор;
			Мероприятие.Организация = Объект.Организация;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ГлавныйОрганизатор = ПараметрыСеанса.Пользователь.Ссылка;
	Объект.Организация = ПараметрыСеанса.Пользователь.Организация;
	Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Черновик;
КонецПроцедуры
